Catsgram-v1/be-back-end/app/controllers/comments_controller.rb

SELECT "cats".* FROM "cats" WHERE "cats"."id" = ? LIMIT ?  [["id", 12], ["LIMIT", 1]]
INSERT INTO "comments" ("cat_id", "comment", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["cat_id", 12], ["comment", "Crazy kitten"], ["created_at", "2021-06-19 15:39:49.398577"], ["updated_at", "2021-06-19 15:39:49.398577"]]
---
    def create

        @comment = Comment.new
        @comment.comment= params[:text]


        @cat = Cat.find_by_id(params[:catId])

        @comment.cat = @cat
        @comment.save

SELECT "comments".* FROM "comments" WHERE "comments"."id" = ? LIMIT ?  [["id", 128], ["LIMIT", 1]]
DELETE FROM "comments" WHERE "comments"."id" = ?  [["id", 128]]
---
    def destroy
        @comment = Comment.find_by_id(params[:id])
        @cat= @comment.cat

        @comment.destroy